#1) შექმენით სია, რომელიც თავდაპირველად იქნება ცარიელი შემდეგ კი ამ სიაში ჩაამატეთ 10 ელემენტი 
array = []
array.append (1)
array.append (2)
array.append (3)
array.append (4)
array.append (5)
array.append (6)
array.append (7)
array.append (8)
array.append (9)
array.append (10)
print(array)
#2) შექმენით ორი სია ერთში თქვენი ხელით ჩაწერეთ ლუწი რიცხვები,
# მეორეში კენტი რიცხვები შემდეგ კი ეს ორი სია გააერთიანეთ extend ის გამოყენებით 
array1=[1,3,5,7,9,11,13,15,17,19,21]
array2=[2,4,6,8,10,12,14,16,18,20,22,24]
array1.extend (array2)
print(array1)
#3) შექმენით სია რომელშიც იქნება 20 ელემენტი, შემდეგ კი დაბეჭდეთ თითოეული სათითაოდ for loop ის გამოყენებით
number = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

for i in number:
    print(i)

#4) შექმენით რიცხვებით სავსე სია რომელშიც იქნება 1 დან 20 მდე ყველა რიცხვი,
#  შემდეგ კი ამ სიიდან ამოშალეთ ყველა კენტი რიცხვი და დაამატეთ ახალ სიაში, ორივე სია დაბეჭდეთ
number1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
print(number1)
for i in number1:
    if i %2 == 0:
        print(i)