#დავალება 1)  0-იდან 20-ის ჩათვლით გამოიტანეთ რიცხვები.
# for i in range(1,21):
#    print(i)



#დავალება 2) მომხმარებელს შემოატანინეთ ორი რიცხვი და მათ შორის არსებულები გამოიტანეთ.
# num1 = int(input("please insert number: "))
# num2 = int(input("please insert number higher than the first: "))
# for i in range(num1,num2):
#     print(i)



#დავალება 3) 50-იდან 100-ის ჩათვლით გამოიტანეთ რიცხვები.
# for i in range(50,101):
#     print(i)


#დავალება 4) დაიწყეთ 100-დან და 50-ის ჩათვლით გამოიტანეთ რიცხვები. (ჩათვალეთ დავალება 3-ის საპირისპირო)


# for i in range(100,49,-1):
#     print(i)





#დავალება 5) 0-იდან 50-ის ჩათვლით გამოიტანეთ რიცხვები და ბოლოს მათი ჯამი.
# cvladi = 0
# for i in range (0,51):
#     cvladi+=i

# print(cvladi)


#დავალება 6) მომხმარებელს შეეკითხეთ რომ შემოიტანოს მთელი რიცხვი. შემდეგ 0-დან ამ რიცხვამდე გამოიტანეთ ყველა მთელი რიცხვი.

# num1 = int(input("please enter a number: " ))
# for i in range(0,num1):
#     print(i)



#დავალება 7) მომხმარებელს შეეკითხეთ ასაკი. შექმენით ცვლადი, სადაც შენახული იქნება 10 წლის შემდეგ მომხმარებლის ასაკი. 
#საბოლოოდ დაპრინტეთ მომხმარებლის ასაკსა და 10 წლის შემდეგ წლოვანებას შორის არსებული მთელი რიცხვები. 

# num1 = int(input("please enter your age"))
# num2 = num1 + 10
# for i in range(num1,num2+1):
#     print(i)


#ახალი დავალებები
#1 შექმენით პროგრამა სადაც მომხმარებელი შემოიტანს 2 რციხვს, ხოლო ამ 2 რიცხვს შორის გამოიყენეთ ყველა არითმეტიკული ოპერაცია 
# (+,-,*,/,%,//), საბოლოოდ დაბეჭდეთ შედეგები ტერმინალში + ახსენით თითოეული ნაწილი კოდის რატომ დაწერეთ კონკრეტული ხაზი 
# და რას აკეთებს.

# num1 = int(input("please enter a numeber: "))
# num2 = int(input("please enter a numeber: "))
# print(num1-num2)
# print(num1+num2)
# print(num1/num2)
# print(num1*num2)
# print(num1%num2)


#2შემოატანინეთ მომხარებელს ასაკი და შეამოწმეთ არის თუ არა 18 წელზე მეტის და 20 წელზე ნაკლების მიღებული შედეგი დაპრინტეთ

# user_age = int(input("please enter your age: "))
# if user_age < 20:
#     print("your age is lower then 20 years old")


# elif user_age == 19:
#     print("your age is higher than 18 but lower than 20")

# elif user_age > 18:
#     print("your age is higher than 18")


#3ჩამოწერეთ ხუთ-ხუთი მაგალითი ყველა ლოგიკურ ოპერატორზე > ,<, <=, >=, !=, == 

# print(12 == 21)
# print(67 <= 68)
# print(70 >= 49)
# print(79 != 69)
# print( 898 > 1283)
# print(3239837 < 3987483242389)



#4  მომხმარებელს პირველ ინფუთში მთელი რიცხვი, ხოლო მეორე ინფუთში ათწილადი შემოატანინეთ.
#  საბოლოოდ შეადარეთ ცვლადების მნიშვნელობების მონაცემთა ტიპები

# num1 = int(input("please enter a full number: "))
#num2 = float(input("please enter a decimal number: "))
# print(type(num1))
# print(type(num2))

#5შექმენით რამოდენიმე სხვადასხვა ტიპის ცვლადი და დაბეჭდეთ მათი მონაცემთა ტიპები

# num1 = True
# num2 = 2.4
# num3 = 347
# num4 = "real madrid"

#6 ) მომხმარებელს შემოატანინეთ 1 დან 7-ის ჩათვლით რომელიმე რიცხვი ამის შემდეგ კი გამოიყენეთ if elif else რომ შეუსაბამოდ კვირის დღე
#  1 ორშაბათისთვის 2 სამშაბათისთვის 3 ოთხშაბათისთვის და ასე შემდეგ

num1 = input("please choose number 1")