// 1) შექმენით ორი ცვლადი სადაც შეინახავთ რიცხვებს. კონსოლში გამოიტანეთ ამ ორი რიცხვის ჯამი.

let cvladi1 = 285
let cvladi2 = 90
console.log(cvladi1 + cvladi2)


// 2) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს და alert-ში გამოიტანეთ "გამარჯობა {ცვლასის მნიშვნელობა}.

let Name = "ლუკა"
alert("გამარჯობა" + " " + Name)


// 3) შექმენით ცვლადები let-ით const-ით და var-ით და კომენტარის სახით განმარტეთ თითოეული მათგანი.
//  კონსოლში გამოიტანეთ ამ ცვლადის მნიშვნელობები

var name1 = "Luka"
let surname = "Gogogkhia"
const age = 13
console.log(name1)
console.log(surname)
console.log(age)
// var_ს let_ს და const_ს ვიყენებთ რომ შევქმნათ ცვლადებს, ჯერ დავწერთ ამ სამისგან რომელიმეს, 
// შემდეგ ცვლადის სახელს და შემდეგ მივანიჭებთ ამ ცვლადს მნიშვნელობას. 
// var სა და let ს შორის დიდი განსხვავება არარის უბრალოდ var არის let ის უხეშად რომ ვთქვათ ბანძი და ძველი ვერსია
// ამიტომ უმჯობესია გამოვიყენოთ let. ხოლო რაც შეეხება const_ს ისიც იგივეა რაც წინა 2 
// უბრალოდ მას ერთხელ რომ გავუწერთ მნიშნველობას ამის შემდეგ სხხვა ხაზის კოდში მნიშვნელობას ვერ შევუცვლით


// 4) შექმენით ცვლადები let-ით const-ით და var-ით, თითოეული მათგანის მნიშვნელობა გაანახლეთ ბევრჯერ და კონსოლში 
// გამოიტანეთ შედეგი. რაც არ იმუშავებს განმარტეთ რატომ არ მუშაობს.


var city = "თბილისი";
let country = "საქართველო";
const year = 2025;

console.log(city);    
console.log(country); 
console.log(year); 

// 4) ცვლადების განახლება

city = "ბათუმი";
console.log(city);

country = "ინგლისი";
console.log(country); 

// const year = 2026;-error

// const-ის განახლება არ მუშაობს
// განმარტება:
// const - მუდმივი, მნიშვნელობას ვერ შევუცვლით.



