#1)რომელ ბიბლიოთეკას ვიყენებთ პითონში გემუტრიული ფიგურის ასაგებად?
#from turtle import *
#2)რომელ ფუნქციას ვიყენებთ რომ ტერმინალში მოვახდინოთ დაბეჭვდა?
print("print")#print()
#3)პითონის გამოყენებით შეგვილია ალგორითმების შექმნა 
False
#4)ათწილადებზე სამუშაოდ რომელ მონაცემთ ტიპს ვიყენებთ?
num1 = float(3)
print(num1)
#5)რომელია პითონისთის სწორი კომენტარი
#comment
#6)რომელ ფუნქციას ვიყენებთ მომხმარებლებლისგან terminal იდან ტექსტის მისაღებად
num2=input("example: ")
#7)ინფუთიდან მიღებული ინფორმაცია ინახება სტრინგის სახით
True
#8)როგორ ვამოწმებთ მინაცემთა ტიპს?
number1= 11
number2 = "luka"
number3 = True or False
print(type(number1))
print(type(number2))
print(type(number3))
#9)რომელი ცვლადი ინახავს ათწილადს?
X = 7
x = 10
Y = 4
y = 10/2
#მეოთხე ცვლადი არის ათწილადი რადგან როდესაც გასაყოფად ვიყენებთ / ამდროს პასუხი ხდება ათწილადი
#10)რომელ ვარიანტშია პითონის ცვლადი სწორად შექმნილი(კომენტარით დავწერ თორე error ს გამოიტანს)
#declare x
#var newVariable=int("5")
#const x = 8
#x = 12
#მეოთხე ვარიანტშია ცვლადი სწორედ შექმნილი
#11)რას გამოტანს კოდი?
#name = "goal"
#surname = "orientadze"
#age = 100 
#print(name + surname + age)
#ეს კოდი გამოიტანს error ს
#12)რას გამოიტანს კოდი?N
NUM1 = 10
NUM2 = 20
print(str(NUM1) + str(NUM2))
#ეს კოდი გამოიტანს 1020 ს
#13)რას გამოიტანს კოდი როდეას მომხმარებელი შეიტანს 7-ს?
NUMBER1 = float(input("enter number: "))
print(type(NUM1))
# ეს კოდი გამოტანს შმედეგ წინადადებას <class 'float'>
#14)პასუხია:
Z = ((True and False) or (False or False))
A = ((False or True) and (False and True))
print((X and Y) or True)
#ეს კოდი გამოტანს True ს
#15)რას გამოიტანს კოდი როდესაც მომხმარებელი შეიყვანს 20-ს
AGE = int(input("enter your age: "))
print(age > 18)
#ეს კოდი გამოიტანს True ს



