# 1)შექმენით ცვლადი საცად შეინახავთ ერთ მთლიან წინადადებას,თქვენი დავალება არის აქციოთ 
# ეს წინადადება სიად სადაც მოთავსებული იქნება თითოეული სიტყვა 
sentence1 = "this is my sentence"
words1 = sentence1.split()

print(words1)


# 2)შექმენი სია სადაც მოთავსებული გექნება სტრინგები,შენი დავალებაა ეს სია აქციო ერთ მთლიან წინადადებად
# (სტრინგად) და თითოეული სიტყვა დაშორებული იყოს ერთმანეთისგან სფეისით

sentence2 = ["this", "is", "my", "sentence"]
words2 = " ".join(sentence2)

print(words2)


#3)შექმენით წინადადება სადაც სიტყვები ერთმანეთისგან დაშორებული იქნება # -ით,თქვენი დავალებაა აქციოთ ეს წინადადება სიად და სიიდან ისევ 
# სტრინგად მაგრამ სიიდან სტრინგად გადაქცევის დროს სიტყვები ერთმანეთისგან დაშორებულები იყვნენ $ -ით

sentence3 = "this#is#my#sentence"
words3 = sentence3.split("#")
words4 = "$".join(words3)

print(words4)