// მომხმარებელს შეეკითხე ქულა (0–100).
// თუ ქულა 90-ზე მეტია → "შესანიშნავი!"
// თუ 70–90 შორისაა → "კარგია!"
// თუ 50–70 შორისაა → "საშუალო შედეგი!"
// თუ ნაკლებია 50-ზე → "მეტი უნდა იმეცადინო!"
let num1 = Number(prompt("please enter a number: "))
if (num1 > 90) {
    alert("შესანიშნავი!")
}
else if (num1 >= 70 && num1 <= 90) {
    alert("კარგია!")
}
else if (num1 >= 50 && num1 <= 70) {
    alert("საშუალო შედეგი!")
}
else if (num1 >= 0 && num1 <= 50) {
    alert("მეტი უნდა იმეცადინო!")
}
else{
    alert("please enter a grade (0-100)")
}