// მოცემული გაქვთ სია: [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 40, 50, 110, 120]

//       შესაბამისი მეთოდების გამოყენებით გამოიტანეთ
//       *. 40 - ის ინდექსები ;
//       *. 30 - ის ინდექსი ;
let list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 40, 50, 110, 120]


let indexes40 = [];
for (let i = 0; i < list.length; i++) {
    if (list[i] === 40) {
        indexes40[indexes40.length] = i;
    }
}

console.log("40-ის ინდექსები:", indexes40)


let index30 = list.indexOf(30)
console.log("30-ის ინდექსი:", index30)
