// 3) შექმენით ცვლადები let-ით const-ით და var-ით და კომენტარის სახით განმარტეთ თითოეული მათგანი.
//  კონსოლში გამოიტანეთ ამ ცვლადის მნიშვნელობები

var name1 = "Luka"
let surname = "Gogogkhia"
const age = 13
console.log(name1)
console.log(surname)
console.log(age)
// var_ს let_ს და const_ს ვიყენებთ რომ შევქმნათ ცვლადებს, ჯერ დავწერთ ამ სამისგან რომელიმეს, 
// შემდეგ ცვლადის სახელს და შემდეგ მივანიჭებთ ამ ცვლადს მნიშვნელობას. 
// var სა და let ს შორის დიდი განსხვავება არარის უბრალოდ var არის let ის უხეშად რომ ვთქვათ ბანძი და ძველი ვერსია
// ამიტომ უმჯობესია გამოვიყენოთ let. ხოლო რაც შეეხება const_ს ისიც იგივეა რაც წინა 2 
// უბრალოდ მას ერთხელ რომ გავუწერთ მნიშნველობას ამის შემდეგ სხვა ხაზის კოდში მნიშვნელობას ვერ შევუცვლით