#შექმენით სია, რომელშიც იქნება 10 ელემენტი. ამ სიის ბოლოში ჩაამატეთ რიცხვი - 1121. 
#და ამოშალეთ  მეორე ინდექსზე მდგომი  ელემენტი და გამოიტანეთ სია ტერმინალში (დაპრინტეთ)
array = [1,2,3,4,5,6,7,8,9,10]

array.append(1121)

array.remove(array[2])

print(array)
#შექმენით სია და ამ სიაში ჩაამატეთ ახალი სიიდან თითოეული ელემენტი. (თვითონ სია არ ჩაამატოთ)
array1 = [1,2,3,4,5,6,7,8,9]
array2 = [10,11,12,13,14,15]

array1.extend(array2)
print(array1)

#შექმენით სია სადაც ჩაწერთ ციფრებს 1-დან 8-ის ჩათვლით.
#for loop-ის საშუალებით მიწვდით თითოეულ ელემენტს და გამოიტანეთ ტერმინალში რომელი ციფრია ლუწი და რომელი კენტი.
array=[1,2,3,4,5,6,7,8]

for i in array:
    if i % 2 == 0:
        print(  "even")
    else:
        print("odd")



