#1)რომელ ბიბლიოთეკას ვიყენებთ პითონში გეომერტრიული ფიგურების ასაგებად?

#turtle

#2)რომელ ფუნქცია სვიყენებთ რო ტერმინალში დაბეჭვდა მოვახდინოთ?

#print

#3)პითონის გამოყენებით შეუძებელია ალგორითმების შექმნა 

# false

#4)ათწილადებზე სამუშაოდ რომელ მონაცემთა ტიპს ვიყენებთ?

#float

#5)რომელია პითონისათვის სწორი კომენტარი?

#we use - # to write a comment in python like im doing now

#6)რომელ ფუნქციას ვიყენებთ მომხმარებლისგან terminal-იდან ტექსტი მისარებად?

#input

#7)input იდან მიღებული ინფორმაცია ინახება string ის სახით

#true

#8)